Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: When the base station includes the storage unit, the storage unit stores a computer executable instruction, the processing unit is connected to the storage unit, and the processing unit executes the computer executable instruction stored in the storage unit, to enable the base station to perform the connection resume request method according to any implementation of the fourth aspect.
de_de: Wenn die Basisstation die Speichereinheit umfasst, speichert die Speichereinheit eine computerausführbare Anweisung, die Verarbeitungseinheit ist mit der Speichereinheit verbunden, und die Verarbeitungseinheit führt die in der Speichereinheit gespeicherte computerausführbare Anweisung aus, um es der Basisstation zu ermöglichen, das Verbindungswiederaufnahmeanforderungsverfahren gemäß einer beliebigen Implementierung des vierten Aspekts durchzuführen.

source: [0053] In another possible design, when the apparatus is the chip in the source base station, the chip includes a receiving unit and a sending unit, and optionally further includes a processing unit.
de_de: [0053] In einer anderen möglichen Ausgestaltung umfasst, wenn die Vorrichtung der Chip in der Quellbasisstation ist, der Chip eine Empfangseinheit und eine Sendeeinheit und umfasst optional ferner eine Verarbeitungseinheit.

source: The processing unit may execute the computer executable instruction stored in the storage unit, so that the connection resume request method according to any implementation of the fourth aspect is performed.
de_de: Die Verarbeitungseinheit kann die in der Speichereinheit gespeicherte computerausführbare Anweisung ausführen, so dass das Verbindungswiederaufnahmeanforderungsverfahren gemäß einer beliebigen Implementierung des vierten Aspekts durchgeführt wird.

source: [0054] The processor mentioned anywhere above may be a general-purpose CPU, a microprocessor, an ASIC, or one or more integrated circuits configured to control program execution of the connection resume request method according to any implementation of the fourth aspect.
de_de: [0054] Der Prozessor, der an einer beliebigen Stelle oben erwähnt ist, kann eine Mehrzweck-CPU, ein Mikroprozessor, eine ASIC oder eine oder mehrere integrierte Schaltungen sein, die konfiguriert sind, um die Programmausführung des Verbindungswiederaufnahmeanforderungsverfahrens gemäß einer beliebigen Implementierung des vierten Aspekts zu steuern.

source: [0055] According to a tenth aspect, this application provides an apparatus.
de_de: [0055] Gemäß einem zehnten Aspekt stellt diese Anmeldung eine Vorrichtung bereit.

source: The apparatus has a function of implementing each embodiment of the fifth aspect.
de_de: Die Vorrichtung weist eine Funktion zum Implementieren jeder Ausführungsform des fünften Aspekts auf.

source: [0056] In a possible design, when the apparatus is the source base station, the base station includes a receiving unit and a sending unit, and optionally further includes a processing unit.
de_de: [0056] In einer möglichen Ausgestaltung beinhaltet die Basisstation, wenn die Vorrichtung die Quellbasisstation ist, eine Empfangseinheit und eine Sendeeinheit und optional ferner eine Verarbeitungseinheit.

source: When the base station includes the storage unit, the storage unit stores a computer executable instruction, the processing unit is connected to the storage unit, and the processing unit executes the computer executable instruction stored in the storage unit, to enable the base station to perform the connection resume request method according to any implementation of the fifth aspect.
de_de: Wenn die Basisstation die Speichereinheit umfasst, speichert die Speichereinheit eine computerausführbare Anweisung, die Verarbeitungseinheit ist mit der Speichereinheit verbunden, und die Verarbeitungseinheit führt die in der Speichereinheit gespeicherte computerausführbare Anweisung aus, um es der Basisstation zu ermöglichen, das Verbindungswiederaufnahmeanforderungsverfahren gemäß einer beliebigen Implementierung des fünften Aspekts durchzuführen.

source: [0057] In another possible design, when the apparatus is the chip in the source base station, the chip includes a receiving unit and a sending unit, and optionally further includes a processing unit.
de_de: [0057] In einer anderen möglichen Ausgestaltung umfasst, wenn die Vorrichtung der Chip in der Quellbasisstation ist, der Chip eine Empfangseinheit und eine Sendeeinheit und umfasst optional ferner eine Verarbeitungseinheit.

source: The processing unit may execute the computer executable instruction stored in the storage unit, so that the connection resume request method according to any implementation of the fifth aspect is performed.
de_de: Die Verarbeitungseinheit kann die in der Speichereinheit gespeicherte computerausführbare Anweisung ausführen, so dass das Verbindungswiederaufnahmeanforderungsverfahren gemäß einer beliebigen Implementierung des fünften Aspekts durchgeführt wird.

source: [0058] The processor mentioned anywhere above may be a general-purpose CPU, a microprocessor, an ASIC, or one or more integrated circuits configured to control program execution of the connection resume request method according to any implementation of the fifth aspect.
de_de: [0058] Der Prozessor, der an einer beliebigen Stelle oben erwähnt ist, kann eine Mehrzweck-CPU, ein Mikroprozessor, eine ASIC oder eine oder mehrere integrierte Schaltungen sein, die konfiguriert sind, um die Programmausführung des Verbindungswiederaufnahmeanforderungsverfahrens gemäß einer beliebigen Implementierung des fünften Aspekts zu steuern.

source: [0059] According to an eleventh aspect, this application further provides a computer-readable storage medium, the computer-readable storage medium stores an instruction, and when the instruction is run on a computer, the computer is enabled to perform the methods according to the foregoing aspects.
de_de: [0059] Gemäß einem elften Aspekt stellt diese Anmeldung ferner ein computerlesbares Speichermedium bereit, wobei das computerlesbare Speichermedium eine Anweisung speichert, und wenn die Anweisung auf einem Computer ausgeführt wird, wird der Computer in die Lage versetzt, die Verfahren gemäß den vorstehenden Aspekten durchzuführen.

source: [0060] According to a twelfth aspect, this application further provides a computer program product that includes an instruction, and when the computer program product runs on a computer, the computer is enabled to perform the methods according to the foregoing aspects.
de_de: [0060] Gemäß einem zwölften Aspekt stellt diese Anmeldung ferner ein Computerprogrammprodukt bereit, das eine Anweisung beinhaltet, und wenn das Computerprogrammprodukt auf einem Computer ausgeführt wird, wird der Computer in die Lage versetzt, die Verfahren gemäß den vorstehenden Aspekten durchzuführen.

source: [0061] According to a thirteenth aspect, this application provides a communications system, the system includes the apparatus according to the sixth aspect, the apparatus according to the seventh aspect, and the apparatus according to the ninth aspect, or the system includes the apparatus according to the sixth aspect, the apparatus according to the seventh aspect, and the apparatus according to the tenth aspect, or the system includes the apparatus according to the sixth aspect, the apparatus according to the eighth aspect, and the apparatus according to the ninth aspect, or the system includes the apparatus according to the sixth aspect, the apparatus according to the eighth aspect, and the apparatus according to the tenth aspect.
de_de: [0061] Gemäß einem dreizehnten Aspekt stellt diese Anmeldung ein Kommunikationssystem bereit, wobei das System die Vorrichtung gemäß dem sechsten Aspekt, die Vorrichtung gemäß dem siebten Aspekt und die Vorrichtung gemäß dem neunten Aspekt beinhaltet, oder das System die Vorrichtung gemäß dem sechsten Aspekt, die Vorrichtung gemäß dem siebten Aspekt und die Vorrichtung gemäß dem zehnten Aspekt beinhaltet, oder das System die Vorrichtung gemäß dem sechsten Aspekt, die Vorrichtung gemäß dem achten Aspekt und die Vorrichtung gemäß dem neunten Aspekt beinhaltet, oder das System die Vorrichtung gemäß dem sechsten Aspekt, die Vorrichtung gemäß dem achten Aspekt und die Vorrichtung gemäß dem zehnten Aspekt beinhaltet.

source: [0062] According to a fourteenth aspect, this application further provides a connection resume request method, including: updating, by a terminal, an access stratum key, to obtain an updated access stratum key; generating, by the terminal, an updated integrity protection key based on the updated access stratum key; generating, by the terminal, a message authentication code based on the updated integrity protection key; sending, by the terminal, a connection resume request message to a target base station, where the connection resume request message includes the message authentication code, and the connection resume request message is used to request to resume a radio resource control RRC connection; receiving, by the terminal, a connection resume rejection message from the target base station, where the connection resume rejection message is used to indicate that resuming of the RRC connection that is performed by the terminal is rejected; and resuming, by the terminal, the access stratum key of the terminal to the access stratum key before the update.
de_de: [0062] Gemäß einem vierzehnten Aspekt stellt diese Anmeldung ferner ein Verbindungswiederaufnahmeanforderungsverfahren bereit, das Folgendes beinhaltet: Aktualisieren, durch ein Endgerät, eines Zugriffsschichtschlüssels, um einen aktualisierten Zugriffsschichtschlüssel zu erhalten; Erzeugen, durch das Endgerät, eines aktualisierten Integritätsschutzschlüssels basierend auf dem aktualisierten Zugriffsschichtschlüssel; Erzeugen, durch das Endgerät, eines Nachrichtenauthentifizierungscodes basierend auf dem aktualisierten Integritätsschutzschlüssel; Senden, durch das Endgerät, einer Verbindungswiederaufnahmeanforderungsnachricht an eine Zielbasisstation, wobei die Verbindungswiederaufnahmeanforderungsnachricht den Nachrichtenauthentifizierungscode beinhaltet und die Verbindungswiederaufnahmeanforderungsnachricht verwendet wird, um die Wiederaufnahme einer Funkressourcensteuerungs-( RRC-)Verbindung anzufordern; Empfangen, durch das Endgerät, einer Verbindungswiederaufnahmeablehnungsungsnachricht von der Zielbasisstation, wobei die Verbindungswiederaufnahmeablehnungsungsnachricht verwendet wird, um anzuzeigen, dass die Wiederaufnahme der RRC-Verbindung, die durch das Endgerät durchgeführt wird, abgelehnt wird; und Wiederaufnehmen, durch das Endgerät, des Zugriffsschichtschlüssels des Endgeräts auf den Zugriffsschichtschlüssel vor der Aktualisierung.

source: [0063] Because in the scenario in which the target base station rejects the connection resume request of the terminal, the terminal already updates the access stratum key, to maintain key consistency between the terminal and the source base station, the terminal may alternatively roll back the key to resume the updated access stratum key of the terminal to the access stratum key before the update.
de_de: [0063] Da in dem Szenario, in dem die Zielbasisstation die Verbindungswiederaufnahmeanforderung des Endgeräts zurückweist, das Endgerät bereits den Zugriffsschichtschlüssel aktualisiert, um die Schlüsselkonsistenz zwischen dem Endgerät und der Quellbasisstation aufrechtzuerhalten, kann das Endgerät alternativ den Schlüssel zurückrollen, um den aktualisierten Zugriffsschichtschlüssel des Endgeräts auf den Zugriffsschichtschlüssel vor der Aktualisierung wiederaufzunehmen.

source: Therefore, an objective that key consistency is always maintained between the terminal and the source base station can also be achieved, and further a problem that the terminal cannot resume a connection due to key asynchronization between the terminal and the source base station can be effectively resolved.
de_de: Daher kann auch ein Ziel, dass die Schlüsselkonsistenz zwischen dem Endgerät und der Quellbasisstation immer aufrechterhalten wird, erreicht werden, und ferner kann ein Problem, dass das Endgerät eine Verbindung aufgrund der Schlüsselasynchronisierung zwischen dem Endgerät und der Quellbasisstation nicht wieder aufnehmen kann, effektiv gelöst werden.

source: [0064] According to a fifteenth aspect, this application provides an apparatus.
de_de: [0064] Gemäß einem fünfzehnten Aspekt stellt diese Anmeldung eine Vorrichtung bereit.

source: The apparatus may be a terminal, or may be a chip in a terminal. The apparatus has a function of implementing the embodiment of the fourteenth aspect.
de_de: Die Vorrichtung kann ein Endgerät sein oder kann ein Chip in einem Endgerät sein. Die Vorrichtung weist eine Funktion zum Implementieren der Ausführungsform des vierzehnten Aspekts auf.

source: [0065] In a possible design, when the apparatus is the terminal, the terminal includes a sending unit, a receiving unit, and a processing unit.
de_de: [0065] In einer möglichen Ausgestaltung, wenn die Vorrichtung das Endgerät ist, beinhaltet das Endgerät eine Sendeeinheit, eine Empfangseinheit und eine Verarbeitungseinheit.

source: When the terminal includes the storage unit, the storage unit stores a computer executable instruction, the processing unit is connected to the storage unit, and the processing unit executes the computer executable instruction stored in the storage unit, to enable the terminal to perform the connection resume request method according to the fourteenth aspect.
de_de: Wenn das Endgerät die Speichereinheit umfasst, speichert die Speichereinheit eine computerausführbare Anweisung, die Verarbeitungseinheit ist mit der Speichereinheit verbunden, und die Verarbeitungseinheit führt die in der Speichereinheit gespeicherte computerausführbare Anweisung aus, um es dem Endgerät zu ermöglichen, das Verbindungswiederaufnahmeanforderungsverfahren gemäß dem vierzehnten Aspekt durchzuführen.

source: [0066] In another possible design, when the apparatus is the chip in the terminal, the chip includes a sending unit, a receiving unit, and a processing unit.
de_de: [0066] In einer anderen möglichen Ausgestaltung umfasst, wenn die Vorrichtung der Chip in dem Endgerät ist, der Chip eine Sendeeinheit, eine Empfangseinheit und eine Verarbeitungseinheit.

source: The processing unit may execute the computer executable instruction stored in the storage unit, so that the connection resume request method according to the fourteenth aspect is performed.
de_de: Die Verarbeitungseinheit kann die in der Speichereinheit gespeicherte computerausführbare Anweisung ausführen, so dass das Verbindungswiederaufnahmeanforderungsverfahren gemäß dem vierzehnten Aspekt durchgeführt wird.

source: [0067] The processor mentioned anywhere above may be a general-purpose CPU, a microprocessor, an ASIC, or one or more integrated circuits configured to control program execution of the connection resume request method according to the fourteenth aspect.
de_de: [0067] Der Prozessor, der an einer beliebigen Stelle oben erwähnt ist, kann eine Mehrzweck-CPU, ein Mikroprozessor, eine ASIC oder eine oder mehrere integrierte Schaltungen sein, die konfiguriert sind, um die Programmausführung des Verbindungswiederaufnahmeanforderungsverfahrens gemäß dem vierzehnten Aspekt zu steuern.

source: [0068] These aspects or other aspects of this application are clearer and comprehensible in descriptions of the following embodiments.
de_de: [0068] Diese Aspekte oder andere Aspekte dieser Anmeldung sind klarer und verständlicher in Beschreibungen der folgenden Ausführungsformen.

source: BRIEF DESCRIPTION OF DRAWINGS
de_de: KURZE BESCHREIBUNG DER ZEICHNUNGEN

source: [0069] FIG. 1 is a schematic diagram of a possible network architecture according to this application;
de_de: [0069] FIG. 1 ist ein schematisches Diagramm einer möglichen Netzwerkarchitektur gemäß dieser Anmeldung;

source: [0070] FIG. 2 is a schematic diagram of a process of entering an inactive state from a connected state by a terminal according to this application;
de_de: [0070] FIG. 2 ist ein schematisches Diagramm eines Prozesses des Eintretens in einen inaktiven Zustand aus einem verbundenen Zustand durch ein Endgerät gemäß dieser Anmeldung;

source: [0071] FIG. 3 is a flowchart of a connection resume request method according to this application;
de_de: [0071] FIG. 3 ist ein Flussdiagramm eines Verbindungswiederaufnahmeanforderungsverfahrens gemäß dieser Anmeldung;

source: [0072] FIG. 4 is a flowchart of another connection resume request method according to this application;
de_de: [0072] FIG. 4 ist ein Flussdiagramm eines weiteren Verbindungswiederaufnahmeanforderungsverfahrens gemäß dieser Anmeldung;

source: [0073] FIG. 5 is a flowchart of another connection resume request method according to this application;
de_de: [0073] FIG. 5 ist ein Flussdiagramm eines weiteren Verbindungswiederaufnahmeanforderungsverfahrens gemäß dieser Anmeldung;

source: [0074] FIG. 6 is a flowchart of another connection resume request method according to this application;
de_de: [0074] FIG. 6 ist ein Flussdiagramm eines weiteren Verbindungswiederaufnahmeanforderungsverfahrens gemäß dieser Anmeldung;

source: [0075] FIG. 7 is a flowchart of another connection resume request method according to this application;
de_de: [0075] FIG. 7 ist ein Flussdiagramm eines weiteren Verbindungswiederaufnahmeanforderungsverfahrens gemäß dieser Anmeldung;

source: [0076] FIG. 8 is a schematic diagram of an apparatus according to this application;
de_de: [0076] FIG. 8 ist ein schematisches Diagramm einer Vorrichtung gemäß dieser Anmeldung;

source: [0077] FIG. 9 is a schematic diagram of another apparatus according to this application;
de_de: [0077] FIG. 9 ist ein schematisches Diagramm einer weiteren Vorrichtung gemäß dieser Anmeldung;

source: [0078] FIG. 10 is a schematic diagram of another apparatus according to this application; and
de_de: [0078] FIG. 10 ist ein schematisches Diagramm einer weiteren Vorrichtung gemäß dieser Anmeldung; und

source: [0079] FIG. 11 is a schematic diagram of another apparatus according to this application.
de_de: [0079] FIG. 11 ist ein schematisches Diagramm einer weiteren Vorrichtung gemäß dieser Anmeldung.

source: DESCRIPTION OF EMBODIMENTS
de_de: BESCHREIBUNG DER AUSFÜHRUNGSFORMEN

source: [0080] The following further describes in detail this application with reference to the accompanying drawings.
de_de: [0080] Im Folgenden wird diese Anmeldung unter Bezugnahme auf die beiliegenden Zeichnungen ausführlicher beschrieben.

source: A specific operation method in method embodiments may also be applied to an apparatus embodiment or a system embodiment.
de_de: Ein spezifisches Betriebsverfahren in Verfahrensausführungsformen kann auch auf eine Vorrichtungsausführungsform oder eine Systemausführungsform angewendet werden.

source: In the descriptions of this application, unless otherwise stated, "a plurality" means two or more than two.
de_de: In den Beschreibungen dieser Anmeldung bedeutet „mehrere“, sofern nicht anders angegeben, zwei oder mehr als zwei.

source: [0081] It should be noted that the connection resume request method in this application may be performed by an apparatus.
de_de: [0081] Es ist anzumerken, dass das Verbindungswiederaufnahmeanforderungsverfahren in dieser Anmeldung durch eine Vorrichtung durchgeführt werden kann.

source: The apparatus may include an apparatus on a network side and/or an apparatus on a terminal side.
de_de: Die Vorrichtung kann eine Vorrichtung auf einer Netzwerkseite und/oder eine Vorrichtung auf einer Endgeräteseite beinhalten.

source: On the network side, the apparatus may be a base station or a chip in the base station, in other words, the connection resume request method in this application may be performed by the base station or the chip in the base station.
de_de: Auf der Netzwerkseite kann die Vorrichtung eine Basisstation oder ein Chip in der Basisstation sein, mit anderen Worten, das Verbindungswiederaufnahmeanforderungsverfahren in dieser Anwendung kann durch die Basisstation oder den Chip in der Basisstation durchgeführt werden.

source: On the terminal side, the apparatus may be a terminal or a chip in the terminal, in other words, the connection resume request method in this application may be performed by the terminal or the chip in the terminal.
de_de: Auf der Endgeräteseite kann die Vorrichtung ein Endgerät oder ein Chip in dem Endgerät sein, mit anderen Worten, das Verbindungswiederaufnahmeanforderungsverfahren in dieser Anwendung kann durch das Endgerät oder den Chip in dem Endgerät durchgeführt werden.

source: [0082] For ease of description, in this application, an example in which the apparatus is a base station or a terminal is used to describe the connection resume request method.
de_de: [0082] Zur Vereinfachung der Beschreibung wird in dieser Anmeldung ein Beispiel, in dem die Vorrichtung eine Basisstation oder ein Endgerät ist, verwendet, um das Verbindungswiederaufnahmeanforderungsverfahren zu beschreiben.

source: For an implementation method in which the apparatus is a chip in the base station or a chip in the terminal, refer to specific descriptions of the connection resume request method of the base station or the terminal. Details are not described.
de_de: Für ein Implementierungsverfahren, in dem die Vorrichtung ein Chip in der Basisstation oder ein Chip in dem Endgerät ist, beziehen Sie sich auf spezifische Beschreibungen des Verbindungswiederaufnahmeanforderungsverfahrens der Basisstation oder des Endgeräts. Details werden nicht beschrieben.

source: [0083] FIG. 1 is a schematic diagram of a possible network architecture according to this application.
de_de: [0083] FIG. 1 ist ein schematisches Diagramm einer möglichen Netzwerkarchitektur gemäß dieser Anmeldung.

source: The network architecture includes a terminal, a source base station, and a target base station.
de_de: Die Netzwerkarchitektur beinhaltet ein Endgerät, eine Quellbasisstation und eine Zielbasisstation.

source: The terminal communicates with the source base station and the target base station by using a wireless interface.
de_de: Das Endgerät kommuniziert mit der Quellbasisstation und der Zielbasisstation unter Verwendung einer drahtlosen Schnittstelle.

source: The source base station and the target base station may communicate with each other by using a wired connection, for example, communicate with each other by using an X2 interface or an Xn interface, or may communicate with each other by using an air interface.
de_de: Die Quellbasisstation und die Zielbasisstation können unter Verwendung einer drahtgebundenen Verbindung miteinander kommunizieren, zum Beispiel unter Verwendung einer X2-Schnittstelle oder einer Xn-Schnittstelle miteinander kommunizieren, oder können unter Verwendung einer Luftschnittstelle miteinander kommunizieren.

source: [0084] In this application, due to reasons such as movement of the terminal, the terminal may move from the source base station to the target base station.
de_de: [0084] In dieser Anmeldung kann sich das Endgerät aus Gründen wie etwa der Bewegung des Endgeräts von der Quellbasisstation zu der Zielbasisstation bewegen.

source: The source base station is a base station that the terminal first accesses, and the target base station is a base station that the terminal latterly accesses after moving.
de_de: Die Quellbasisstation ist eine Basisstation, auf die das Endgerät zuerst zugreift, und die Zielbasisstation ist eine Basisstation, auf die das Endgerät nach der Bewegung zuletzt zugreift.
